In [2]:
import pandas as pd
import numpy as np
import seaborn as sns

In [3]:
titanic = sns.load_dataset("titanic") 
titanic.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

In [4]:
titanic.describe().T

          count       mean        std   min      25%      50%   75%       max
survived  891.0   0.383838   0.486592  0.00   0.0000   0.0000   1.0    1.0000
pclass    891.0   2.308642   0.836071  1.00   2.0000   3.0000   3.0    3.0000
age       714.0  29.699118  14.526497  0.42  20.1250  28.0000  38.0   80.0000
sibsp     891.0   0.523008   1.102743  0.00   0.0000   0.0000   1.0    8.0000
parch     891.0   0.381594   0.806057  0.00   0.0000   0.0000   0.0    6.0000
fare      891.0  32.204208  49.693429  0.00   7.9104  14.4542  31.0  512.3292

In [13]:
print(titanic[titanic['age']<33][['pclass','age']])

     pclass   age
0         3  22.0
2         3  26.0
7         3   2.0
8         3  27.0
9         2  14.0
..      ...   ...
884       3  25.0
886       2  27.0
887       1  19.0
889       1  26.0
890       3  32.0

[448 rows x 2 columns]

In [14]:
titanic['age_0']=0

In [16]:
print(titanic)

     survived  pclass     sex   age  sibsp  parch     fare embarked   class  \
0           0       3    male  22.0      1      0   7.2500        S   Third
1           1       1  female  38.0      1      0  71.2833        C   First
2           1       3  female  26.0      0      0   7.9250        S   Third
3           1       1  female  35.0      1      0  53.1000        S   First
4           0       3    male  35.0      0      0   8.0500        S   Third
..        ...     ...     ...   ...    ...    ...      ...      ...     ...
886         0       2    male  27.0      0      0  13.0000        S  Second
887         1       1  female  19.0      0      0  30.0000        S   First
888         0       3  female   NaN      1      2  23.4500        S   Third
889         1       1    male  26.0      0      0  30.0000        C   First
890         0       3    male  32.0      0      0   7.7500        Q   Third

       who  adult_male deck  embark_town alive  alone  age_0
0      man        True  NaN  Southampton    no  False      0
1    woman       False    C    Cherbourg   yes  False      0
2    woman       False  NaN  Southampton   yes   True      0
3    woman       False    C  Southampton   yes  False      0
4      man        True  NaN  Southampton    no   True      0
..     ...         ...  ...          ...   ...    ...    ...
886    man        True  NaN  Southampton    no   True      0
887  woman       False    B  Southampton   yes   True      0
888  woman       False  NaN  Southampton    no  False      0
889    man        True    C    Cherbourg   yes   True      0
890    man        True  NaN   Queenstown    no   True      0

[891 rows x 16 columns]

In [17]:
titanic['age_0']=titanic['age']*10
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone,age_0
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False,220.0
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False,380.0
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True,260.0
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False,350.0
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True,350.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True,270.0
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True,190.0
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False,NaN
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True,260.0
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True,320.0

In [18]:
titanic= titanic.drop('age_0', axis=1)
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [19]:
#pclass기준 내림차순정렬
titanic.sort_values(by=['pclass'], ascending=False)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
511,0,3,male,NaN,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
500,0,3,male,17.0,0,0,8.6625,S,Third,man,True,NaN,Southampton,no,True
501,0,3,female,21.0,0,0,7.7500,Q,Third,woman,False,NaN,Queenstown,no,True
502,0,3,female,NaN,0,0,7.6292,Q,Third,woman,False,NaN,Queenstown,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
102,0,1,male,21.0,0,1,77.2875,S,First,man,True,D,Southampton,no,False
710,1,1,female,24.0,0,0,49.5042,C,First,woman,False,C,Cherbourg,yes,True
711,0,1,male,NaN,0,0,26.5500,S,First,man,True,C,Southampton,no,True
712,1,1,male,48.0,1,0,52.0000,S,First,man,True,C,Southampton,yes,False
445,1,1,male,4.0,0,2,81.8583,S,First,child,False,A,Southampton,yes,False

In [26]:
#pclass그룹의 age 최소값 최대값 합계
titanic.groupby(by='pclass')['age'].agg([min,max,sum])

         min   max      sum
pclass
1       0.92  80.0  7111.42
2       0.67  70.0  5168.83
3       0.42  74.0  8924.92

In [28]:
#pclass그룹의 age평균, survived합계
agg_format={'age':'mean', 'survived':'sum'}
titanic.groupby(by='pclass').agg(agg_format)

              age  survived
pclass
1       38.233441       136
2       29.877630        87
3       25.140620       119

In [29]:
#sex그룹의 age평균, survived합계
titanic.groupby(by='sex').agg(agg_format)

              age  survived
sex
female  27.915709       233
male    30.726645       109

In [11]:
np.random.seed()
df1 = pd.DataFrame(np.random.randint(10, size=(4,8)))
df1

   0  1  2  3  4  5  6  7
0  9  7  2  6  8  7  7  7
1  6  6  4  6  8  4  7  8
2  5  0  1  7  1  8  1  2
3  6  9  5  1  4  1  5  1